In [1]:
#1.Import pandas under the name pd.
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
#2. Print the version of pandas that has been imported.
pd.__version__

'0.23.4'

In [57]:
#3. Print out all the version information of the libraries that are required 
#by the pandas library.
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.6.5.final.0
python-bits: 64
OS: Linux
OS-release: 4.4.0-17134-Microsoft
machine: x86_64
processor: x86_64
byteorder: little
LC_ALL: None
LANG: C.UTF-8
LOCALE: en_US.UTF-8

pandas: 0.23.4
pytest: None
pip: 9.0.1
setuptools: 40.2.0
Cython: None
numpy: 1.15.0
scipy: None
pyarrow: None
xarray: None
IPython: 6.5.0
sphinx: None
patsy: None
dateutil: 2.7.3
pytz: 2018.5
blosc: None
bottleneck: None
tables: None
numexpr: None
feather: None
matplotlib: 2.2.3
openpyxl: None
xlrd: None
xlwt: None
xlsxwriter: None
lxml: None
bs4: None
html5lib: 0.999999999
sqlalchemy: None
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: None

In [8]:
#4. Create a DataFrame df from this dictionary data which has the index labels.
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index = labels)

In [9]:
#5. Display a summary of the basic information about this DataFrame and its data.
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [10]:
#6. Return the first 3 rows of the DataFrame df.
df[0:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [13]:
#7. Select just the 'animal' and 'age' columns from the DataFrame df.
df_animal_age = df[['animal','age']]
df_animal_age

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [19]:
#8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].
df_animal_age.iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [15]:
#9. Select only the rows where the number of visits is greater than 3.
df.loc[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [16]:
#10. Select the rows where the age is missing, i.e. is NaN.
df.loc[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [21]:
#11. Select the rows where the animal is a cat and the age is less than 3.
df.loc[(df['animal'] == 'cat') & (df['age'] <3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [20]:
#12. Select the rows the age is between 2 and 4 (inclusive).
df.loc[(df['age'] <=4 ) & (df['age'] >=2)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [15]:
#13. Change the age in row 'f' to 1.5.
df.loc[['f'],['age']] = 1.5
df.loc[['f']]

  animal  age  visits priority
f    cat  1.5       3       no

In [16]:
#14. Calculate the sum of all visits (the total number of visits).
df[['visits']].sum()

visits    19
dtype: int64

In [17]:
#15. Calculate the mean age for each different animal in df.
df2 = df.copy()
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [18]:
#15. Calculate the mean age for each different animal in df.
snake = df2[df2['animal'].isin(['snake'])]
snake[['age']].mean()

age    2.5
dtype: float64

In [19]:
#15. Calculate the mean age for each different animal in df.
dog = df2[df2['animal'].isin(['dog'])]
dog[['age']].mean()

age    5.0
dtype: float64

In [20]:
#15. Calculate the mean age for each different animal in df.
cat = df2[df2['animal'].isin(['cat'])]
cat[['age']].mean()

age    2.333333
dtype: float64

In [24]:
#16. Append a new row 'k' to df with your choice of values for each column. 
#Then delete that row to return the original DataFrame.
df.loc['k']=['dog',100,3,'yes']
df

  animal    age  visits priority
a    cat    2.5       1      yes
b    cat    3.0       3      yes
c  snake    0.5       2       no
d    dog    NaN       3      yes
e    dog    5.0       2       no
f    cat    2.0       3       no
g  snake    4.5       1       no
h    cat    NaN       1      yes
i    dog    7.0       2       no
j    dog    3.0       1       no
k    dog  100.0       3      yes

In [25]:
#16 Then delete that row to return the original DataFrame.
df = df.drop('k')
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [22]:
#17. Count the number of each type of animal in df.
cat[['animal']].count()

animal    4
dtype: int64

In [24]:
#17. Count the number of each type of animal in df.
dog[['animal']].count()

animal    4
dtype: int64

In [25]:
#17. Count the number of each type of animal in df.
snake[['animal']].count()

animal    2
dtype: int64

In [25]:
#18. Sort df first by the values in the 'age' in decending order, 
#then by the value in the 'visit' column in ascending order.
df.sort_values(['age','visits'], ascending =[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [36]:
#19. The 'priority' column contains the values 'yes' and 'no'. 
#Replace this column with a column of boolean values: 'yes' should be 
#True and 'no' should be False.
df = df.replace(to_replace = 'no', value = False)
df = df.replace(to_replace ='yes', value = True)

In [38]:
#20. In the 'animal' column, change the 'snake' entries to 'python'.
df.replace(to_replace ='snake',value = 'python')

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

In [54]:
# 21. For each animal type and each number of visits, find the mean age. 
# In other words, each row is an animal, each column is a number of visits and the values are the mean ages 
# (hint: use a pivot table).
table = pd.pivot_table(df, values = 'age', index = ['animal','visits'], aggfunc=np.mean)
table

                age
animal visits
cat    1       2.50
       3       2.25
dog    1       3.00
       2       6.00
snake  1       4.50
       2       0.50

In [32]:
#22 You have a DataFrame df with a column 'A' of integers. For example:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
# How do you filter out rows which contain the same integer as the row immediately above?
df.drop_duplicates(['A'], keep = 'first')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [50]:
# 23. Given a DataFrame of numeric values, say

df = pd.DataFrame(np.random.random(size=(5, 3))) 
# a 5x3 frame of float values. how do you subtract the row mean from each element in the row?

df.sub(df.mean(axis=1), axis=0)

#Use axis=0 to apply a method down each column, or to the row labels (the index).
#Use axis=1 to apply a method across each row, or to the column labels.

          0         1         2
0 -0.284926  0.173221  0.111706
1  0.578031 -0.276268 -0.301763
2 -0.167891  0.181589 -0.013698
3  0.228412 -0.243765  0.015353
4  0.052696 -0.357162  0.304466

In [104]:
# 24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
(df.sum(axis=0)).idxmin()
#Which column of numbers has the smallest sum? (Find that column's label.)

'e'

In [105]:
# 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?
len(df.drop_duplicates(keep=False))

5

In [123]:
# 26. You have a DataFrame that consists of 10 columns of floating--point numbers. 
# Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, 
# find the column which contains the third NaN value.
# (You should return a Series of column labels.)

df = pd.DataFrame([[np.nan,np.nan,np.nan,4.,np.nan,6.,np.nan,8.,9.,10.],[1.,2.,np.nan,np.nan,np.nan,np.nan,np.nan,8.,9.,10.]], columns=list('1234567890'))
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    3
1    5
dtype: object